using CalcYouLate.MeasurePages;
using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Linq;
using System.Net.Http.Headers;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Controls;

namespace CalcYouLate.Functionality
{
    public class MeasureList
    {
        
        #region Lists of measures
        public string[] Area
        {
            get { return area; }
            set { }
        }
        public string[] area = {
            "ар",
            "гектар",
            "тауншип",
            "акр",
            "квадратный миллиметр мм²",
            "квадратный сантиметр см²",
            "квадратный дециметр дм²",
            "квадратный метр м²",
            "квадратный километр км²",
            "квадратный дюйм²",
            "квадратный фут²",
            "квадратный ярд²",
            "квадратная миля²",
        };

        public string[] Volume
        {
            get { return volume; }
            set { }
        }
        public string[] volume =
        {
            "кубический миллиметр мм³",
            "кубический сантиметр см³",
            "кубический дециметр (литр) дм³",
            "кубический метр м³",
            "кубический километр км³",
            "кубический дюйм³",
            "кубический фут³",
            "кубический ярд³",
            "кубическая миля³",
            "пинта (США)",
            "кварта (США)",
            "галлон (США)",
            "баррель",
        };

        public string[] Length
        {
            get { return length; }
            set { }
        }
        public string[] length =
        {
            "миллиметр",
            "сантиметр",
            "дециметр",
            "метр",
            "километр",
            "дюйм",
            "фут",
            "ярд",
            "миля",
            "морская миля",
            "лига",
            "вершок",
            "сажень",
            "аршин",
            "верста",
            "астрономическая единица",
            "световой год",
            "парсек",
        };

        public string[] Energy
        {
            get { return energy; }
            set { }
        }
        public string[] energy =
        {
            "калория",
            "килокалория",
            "мегакалория",
            "ватт/секунда",
            "киловатт/час",
            "электрон-вольт",
            "терм",
            "килограмм тротила",
            "джоуль",
            "килоджуоль",
        };

        public string[] Weight
        {
            get { return weight; }
            set { }
        }
        public string[] weight =
        {
            "миллиграмм мг",
            "грамм г",
            "килограмм кг",
            "центнер",
            "тонна",
            "стоун",
            "фунт",
            "унция",
            "центнер",
            "гран",
            "карат",
        };

        public string[] Temperature
        {
            get { return temperature; }
            set { }
        }
        public string[] temperature =
        {
            "градус Цельсия",
            "градус Фаренгейта",
            "градус Кельвина",
            "градус Реомюра",
        };

        public string[] Power
        {
            get { return power; }
            set { }
        }
        public string[] power =
        {
            "ватт",
            "киловатт",
            "мегаватт",
            "лошадиная сила",
            "вольт-ампер",
            "фут-фунты/мин",
            "БТЕ/мин",
        };

        public string[] Pressure
        {
            get { return pressure; }
            set { }
        }
        public string[] pressure =
        {
            "бар",
            "паскаль",
            "килопаскаль",
            "миллиметры ртутного столба",
            "фунт/дюйм²",
            "атмосфера",
        };

        public string[] Data
        {
            get { return data; }
            set { }
        }
        public string[] data =
        {
            "бит",
            "байт",
            "килобайт",
            "мегабайт",
            "гигабайт",
            "терабайт",
            "петабайт",
            "эксабайт",
        };

        public string[] Angle
        {
            get { return angle; }
            set { }
        }
        public string[] angle =
        {
            "градус",
            "радиан",
            "минута",
            "секунда",
        };

        public string[] Speed
        {
            get { return speed; }
            set { }
        }
        public string[] speed =
        {
            "метр/сек",
            "метр/мин",
            "метр/час",
            "клометр/сек",
            "клометр/мин",
            "клометр/час",
            "дюйм/сек",
            "фут/мин",
            "фут/час",
            "миль/час",
            "узел",
            "Мах",
        };

        public string[] Time
        {
            get { return time; }
            set { }
        }
        public string[] time =
        {
            "наносекунда",
            "миллисекунда",
            "секунда",
            "минута",
            "час",
            "сутки",
            "неделя",
            "григорианский год",
            "юлианский год",
            "драконический год",
            "век",
        };
        #endregion

        public static Dictionary<string, double> areaToMeters = new Dictionary<string, double>()
        {
            {"ар", 100},
            { "гектар", 10000},
            {"тауншип",  93.2396 },
            { "акр", 4046.86},
            {"квадратный миллиметр мм²", 0.000001},
            {"квадратный сантиметр см²", 0.0001},
            {"квадратный дециметр дм²", 0.01},
            {"квадратный метр м²", 1},
            {"квадратный километр км²", 1000000},
            {"квадратный дюйм²", 0.00064516},
            {"квадратный фут²", 0.09290304},
            {"квадратный ярд²", 0.83612736},
            {"квадратная миля²", 2589988.110336},
        };

        public static Dictionary<string, double> areaFromMeters = new Dictionary<string, double>()
        {
            {"ар", 0.01},
            {"гектар", 0.0001},
            {"тауншип",  0.010725 },
            { "акр", 0.00024710516},
            {"квадратный миллиметр мм²", 1000000},
            {"квадратный сантиметр см²", 10000},
            {"квадратный дециметр дм²", 100},
            {"квадратный метр м²", 1},
            {"квадратный километр км²", 0.000001},
            {"квадратный дюйм²", 1550.0031000062},
            {"квадратный фут²", 10.76391041671},
            {"квадратный ярд²", 1.1959900463},
            {"квадратная миля²", 0.0000003861},
        };

        public static Dictionary<string, double> volumeFromMeters3 = new Dictionary<string, double>()
        {
            { "кубический миллиметр мм³", 1000000000},
            {"кубический сантиметр см³", 1000000},
            {"кубический дециметр (литр) дм³",1000},
            {"кубический метр м³",1},
            { "кубический километр км³",0.000000001},
            { "кубический дюйм³",61024},
            {  "кубический фут³", 35.31},
            { "кубический ярд³", 1.308},
            { "кубическая миля³",0.0000000002399},
            {"пинта (США)",2113.376},
            { "кварта (США)", 1056.688},
            { "галлон (США)", 264.1721},
            { "баррель", 6.29},
        };

        public static Dictionary<string, double> volumeToMeters3 = new Dictionary<string, double>()
        {
            { "кубический миллиметр мм³", 0.000000001},
            {"кубический сантиметр см³", 0.000001},
            {"кубический дециметр (литр) дм³",0.001},
            {"кубический метр м³",1},
            { "кубический километр км³", 1000000000},
            { "кубический дюйм³",0.00001638699},
            {  "кубический фут³", 0.0283205},
            { "кубический ярд³", 0.764525},
            { "кубическая миля³",4168403501.458},
            {"пинта (США)",0.000473},
            { "кварта (США)",  0.000946},
            { "галлон (США)", 0.003785},
            { "баррель", 0.159},
        };

        public static Dictionary<string, double> lengthToMeters = new Dictionary<string, double>()
        {
            { "миллиметр", 0.001 },
            {"сантиметр", 0.01},
            {"дециметр", 0.1},
            {"метр", 1},
            {"километр", 1000},
            {"дюйм", 0.0254},
            {"фут", 0.3048},
            {"ярд", 0.9144},
            {"миля", 1609.344},
            {"морская миля", 1852},
            {"лига", 4828.032},
            {"вершок", 0.04445},
            {"сажень", 2.1336},
            {"аршин", 0.7112},
            {"верста", 1066.8},
            {"астрономическая единица", 149597870700},
            {"световой год", 9460730472580800},
            {"парсек", 30856775814671900},
        };

        public static Dictionary<string, double> lengthFromMeters = new Dictionary<string, double>()
        {
            { "миллиметр", 1000 },
            {"сантиметр", 100},
            {"дециметр", 10},
            {"метр", 1},
            {"километр", 0.001},
            {"дюйм", 39.3701},
            {"фут", 3.28084},
            {"ярд", 1.09361},
            {"миля", 0.000621371},
            {"морская миля", 0.000539957},
            {"лига", 0.000207125},
            {"вершок", 22.5},
            {"сажень", 0.468559},
            {"аршин", 1.40607},
            {"верста", 0.000937383},
            {"астрономическая единица", 6.68459E-12},
            {"световой год", 1.057E-16},
            {"парсек", 3.24078E-17}
        };

        public static Dictionary<string, double> energyToJoules = new Dictionary<string, double>()
        {
            {"калория", 4.184},
            {"килокалория", 4184},
            {"мегакалория", 4184000},
            {"ватт/секунда", 1},
            {"киловатт/час", 3600000},
            {"электрон-вольт", 1.602e-19},
            {"терм", 105505600},
            {"килограмм тротила", 4612070},
            {"джоуль", 1},
            {"килоджоуль", 1000}
        };

        public static Dictionary<string, double> energyFromJoules = new Dictionary<string, double>()
        {
            {"калория", 0.239},
            {"килокалория", 0.000239},
            {"мегакалория", 0.000000239},
            {"ватт/секунда", 1},
            {"киловатт/час", 0.000278},
            {"электрон-вольт", 6.242e+18},
            {"терм", 0.00000947},
            {"килограмм тротила", 0.000000217},
            {"джоуль", 1},
            {"килоджоуль", 0.001}
        };

        public static Dictionary<string, double> weightToKilograms = new Dictionary<string, double>()
        {
            {"миллиграмм мг", 0.000001},
            {"грамм г", 0.001},
            {"килограмм кг", 1},
            {"центнер", 100},
            {"тонна", 1000},
            {"стоун", 6.35029},
            {"фунт", 0.453592},
            {"унция", 0.0283495},
            {"гран", 0.0000647989},
            {"карат", 0.0002}
        };

        public static Dictionary<string, double> weightFromKilograms = new Dictionary<string, double>()
        {
            {"миллиграмм мг", 1000000},
            {"грамм г", 1000},
            {"килограмм кг", 1},
            {"центнер", 0.01},
            {"тонна", 0.001},
            {"стоун", 0.157473},
            {"фунт", 2.20462},
            {"унция", 35.2739},
            {"гран", 15432.3584},
            {"карат", 5000}
        };

        public static Dictionary<string, double> tempatureToCelsius = new Dictionary<string, double>()
        {
            {"градус Цельсия", 1},
            {"градус Фаренгейта", -17.22},
            {"градус Кельвина", -272.15},
            {"градус Реомюра", 1.25}
        };

        public static Dictionary<string, double> tempatureFromCelsius = new Dictionary<string, double>()
        {
            {"градус Цельсия", 1},
            {"градус Фаренгейта", 33.8},
            {"градус Кельвина", 274.15},
            {"градус Реомюра", 0.8}
        };

        public static Dictionary<string, double> powerToWatt = new Dictionary<string, double>()
        {
            {"ватт", 1},
            {"киловатт", 1000},
            {"мегаватт", 1000000},
            {"лошадиная сила", 735.5},
            {"вольт-ампер", 1},
            {"фут-фунты/мин", 0.0225969658},
            {"БТЕ/мин", 17.5842667}
        };

        public static Dictionary<string, double> powerFromWatt = new Dictionary<string, double>()
        {
            {"ватт", 1},
            {"киловатт", 0.001},
            {"мегаватт", 0.000001},
            {"лошадиная сила", 0.0014},
            {"вольт-ампер", 1},
            {"фут-фунты/мин", 1423.8216274234},
            {"БТЕ/мин", 3.414425}
        };

        public static Dictionary<string, double> pressureToPascal = new Dictionary<string, double>()
        {
            {"бар", 100000},
            {"паскаль", 1},
            {"килопаскаль", 1000},
            {"миллиметры ртутного столба", 133.322},
            {"фунт/дюйм²", 6894.76},
            {"атмосфера", 101325}
        };

        public static Dictionary<string, double> pressureFromPascal = new Dictionary<string, double>()
        {
            {"бар", 0.00001},
            {"паскаль", 1},
            {"килопаскаль", 0.001},
            {"миллиметры ртутного столба", 0.0075},
            {"фунт/дюйм²", 0.00015},
            {"атмосфера", 0.0000099}
        };

    }
}
